
<?php

echo ' Накопление результата в цикле PHP' . '<br>';
echo ' C помощью цикла найдем сумму целых чисел от 1 до 100' . '<br>';

$result = 0;

for ($i = 1; $i <= 100; $i++) {
    $result = $result + $i;
}

echo 'Искомая сумма целых чисел от 1 до 100 = ' . $result; // искомая сумма
echo '<br>' . ' //----------------------------------------------------------------------------' . '<br>';
//----------------------------------------------------------------------------
echo  '<br>' . '<br>';
echo ' Задача 1' . '<br>';
echo ' C помощью цикла найдем сумму целых чисел от 1 до 20' . '<br>';

$result = 0;

for ($i = 1; $i <= 20; $i++) {
    $result = $result + $i;
}

echo 'Искомая сумма целых чисел от 1 до 20 = ' . $result . '<br>'; // искомая сумма
echo  '<br>' . ' //----------------------------------------------------------------------------' . '<br>';

//----------------------------------------------------------------------------
echo  '<br>' . '<br>';
echo ' Задача 2' . '<br>';
echo ' Найдите сумму четных чисел от 2 до 100.' . '<br>';

$result = 0;

for ($i = 2; $i <= 100; $i = $i + 2) {
    $result = $result + $i;
}

echo 'Искомая сумму четных чисел от 2 до 100 = ' . $result . '<br>'; // искомая сумма
echo  '<br>' . ' //----------------------------------------------------------------------------' . '<br>';
//----------------------------------------------------------------------------
echo  '<br>' . '<br>';
echo ' Задача 3' . '<br>';
echo ' Найдите сумму нечетных чисел от 1 до 99.' . '<br>';

$result = 0;

for ($i = 1; $i <= 99; $i = $i + 2) {
    $result = $result + $i;
}

echo 'Искомая сумму нечетных чисел от 1 до 99 = ' . $result . '<br>'; // искомая сумма
echo  '<br>' . ' //----------------------------------------------------------------------------' . '<br>';








?>