<?php

/*
 * PHP Start | Теория
 * Урок 3: Основы
 * Задача 3
 */

/*
 * Создайте 3 переменных с произвольными именами на свой выбор. Присвойте им 
 * значения 3,5,8 соответственно. Выведите значения этих переменных на страницу.
 */

$a = 1;
$b = 2;
$c = 3;

/*
 *  Найдите сумму этих переменных и запишите ее в новую переменную. Выведите 
 * значение новой переменной. 
 */

$sum = $a + $b + $c;
echo $sum;

// Напечатаем html-тег для переноса строки
echo '<br>';

/*
 * Найдите значение такого выражения: 2 + 6 + 2 / 5 - 1. Запишите его в
 *  переменную с именем $result и выведите на страницу. 
 */
$result = 2+6+2/5-1;
echo $result;