<?php
switch (переменная) {
    case 'значение1':
        /*
            здесь код, который выполнится в случае,
            если переменная имеет значение1
        */
        break;
    case 'значение2':
        /*
            здесь код, который выполнится в случае,
            если переменная имеет значение2
        */
        break;
    case 'значение3':
        /*
            здесь код, который выполнится в случае,
            если переменная имеет значение3
        */
        break;
    default:
        /*
            здесь код, который выполнится в случае,
            если не совпала ни с одним значением
        */
        break;
}
