<?php
// ! TASK 1 Переменная $num может принимать значения 1, 2, 3 или 4. Определите, в какую пору года попадает значение этой переменной.
// $TimeOfYear = '3';
// switch ($TimeOfYear) {
//     case '1':
//         echo 'Вы выбали время года - зима';
//         break;
//     case '2':
//         echo 'Вы выбали время года -  весна';
//         break;
//     case '3':
//         echo 'Вы выбали время года - лето';
//         break;
//     case '4':
//         echo 'Вы выбали время года - осень';
//         break;
//     default:
//         echo 'Такого времени года не существует';
//         break;
// }
$num = 1;

switch ($num) {
    case 1:
        echo 1;
    case 2:
        echo 2;
    case 3:
        echo 3;
}
